Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_adc2.h
/*
; stm32V873_adc2.
; ===============

; SPDX-License-Identifier: MIT

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     stm32V873_adc2 equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// ADC2 address definitions
// ------------------------

typedef struct {
    volatile    uint32_t    ISR;
    volatile    uint32_t    IER;
    volatile    uint32_t    CR;
    volatile    uint32_t    CFGR1;
    volatile    uint32_t    CFGR2;
    volatile    uint32_t    SMPR1;
    volatile    uint32_t    SMPR2;
    volatile    uint32_t    PCSEL;
    volatile    uint32_t    RESERVED0[4];
    volatile    uint32_t    SQR1;
    volatile    uint32_t    SQR2;
    volatile    uint32_t    SQR3;
    volatile    uint32_t    SQR4;
    volatile    uint32_t    DR;
    volatile    uint32_t    RESERVED1[2];
    volatile    uint32_t    JSQR;
    volatile    uint32_t    OFCFGR1;
    volatile    uint32_t    OFCFGR2;
    volatile    uint32_t    OFCFGR3;
    volatile    uint32_t    OFCFGR4;
    volatile    uint32_t    OFR1;
    volatile    uint32_t    OFR2;
    volatile    uint32_t    OFR3;
    volatile    uint32_t    OFR4;
    volatile    uint32_t    GCOMP;
    volatile    uint32_t    RESERVED2[3];
    volatile    uint32_t    JDR1;
    volatile    uint32_t    JDR2;
    volatile    uint32_t    JDR3;
    volatile    uint32_t    JDR4;
    volatile    uint32_t    RESERVED3[4];
    volatile    uint32_t    AWD2CR;
    volatile    uint32_t    AWD3CR;
    volatile    uint32_t    AWD1LTR;
    volatile    uint32_t    AWD1HTR;
    volatile    uint32_t    AWD2LTR;
    volatile    uint32_t    AWD2HTR;
    volatile    uint32_t    AWD3LTR;
    volatile    uint32_t    AWD3HTR;
    volatile    uint32_t    DIFSEL;
    volatile    uint32_t    CALFACT;
    volatile    uint32_t    RESERVED4[2];
    volatile    uint32_t    OR;
} ADC2_TypeDef;

#if (defined(__cplusplus))
#define ADC2_S  reinterpret_cast<ADC2_TypeDef *>(0x50022100u)

#else
#define ADC2_S  ((ADC2_TypeDef *)0x50022100u)
#endif

// ISR Configuration

#define ADC2_ISR_LDORDY                     (0x1u<<12)
#define ADC2_ISR_JQOVF                      (0x1u<<10)
#define ADC2_ISR_AWD3                       (0x1u<<9)
#define ADC2_ISR_AWD2                       (0x1u<<8)
#define ADC2_ISR_AWD1                       (0x1u<<7)
#define ADC2_ISR_JEOS                       (0x1u<<6)
#define ADC2_ISR_JEOC                       (0x1u<<5)
#define ADC2_ISR_OVR                        (0x1u<<4)
#define ADC2_ISR_EOS                        (0x1u<<3)
#define ADC2_ISR_EOC                        (0x1u<<2)
#define ADC2_ISR_EOSMP                      (0x1u<<1)
#define ADC2_ISR_ADRDY                      (0x1u<<0)

#define ADC2_ISR_LDORDY_B_0X0               (0x0u<<12)
#define ADC2_ISR_LDORDY_B_0X1               (0x1u<<12)
#define ADC2_ISR_JQOVF_B_0X0                (0x0u<<10)
#define ADC2_ISR_JQOVF_B_0X1                (0x1u<<10)
#define ADC2_ISR_AWD3_B_0X0                 (0x0u<<9)
#define ADC2_ISR_AWD3_B_0X1                 (0x1u<<9)
#define ADC2_ISR_AWD2_B_0X0                 (0x0u<<8)
#define ADC2_ISR_AWD2_B_0X1                 (0x1u<<8)
#define ADC2_ISR_AWD1_B_0X0                 (0x0u<<7)
#define ADC2_ISR_AWD1_B_0X1                 (0x1u<<7)
#define ADC2_ISR_JEOS_B_0X0                 (0x0u<<6)
#define ADC2_ISR_JEOS_B_0X1                 (0x1u<<6)
#define ADC2_ISR_JEOC_B_0X0                 (0x0u<<5)
#define ADC2_ISR_JEOC_B_0X1                 (0x1u<<5)
#define ADC2_ISR_OVR_B_0X0                  (0x0u<<4)
#define ADC2_ISR_OVR_B_0X1                  (0x1u<<4)
#define ADC2_ISR_EOS_B_0X0                  (0x0u<<3)
#define ADC2_ISR_EOS_B_0X1                  (0x1u<<3)
#define ADC2_ISR_EOC_B_0X0                  (0x0u<<2)
#define ADC2_ISR_EOC_B_0X1                  (0x1u<<2)
#define ADC2_ISR_EOSMP_B_0X0                (0x0u<<1)
#define ADC2_ISR_EOSMP_B_0X1                (0x1u<<1)
#define ADC2_ISR_ADRDY_B_0X0                (0x0u<<0)
#define ADC2_ISR_ADRDY_B_0X1                (0x1u<<0)

// IER Configuration

#define ADC2_IER_LDORDYIE                   (0x1u<<12)
#define ADC2_IER_JQOVFIE                    (0x1u<<10)
#define ADC2_IER_AWD3IE                     (0x1u<<9)
#define ADC2_IER_AWD2IE                     (0x1u<<8)
#define ADC2_IER_AWD1IE                     (0x1u<<7)
#define ADC2_IER_JEOSIE                     (0x1u<<6)
#define ADC2_IER_JEOCIE                     (0x1u<<5)
#define ADC2_IER_OVRIE                      (0x1u<<4)
#define ADC2_IER_EOSIE                      (0x1u<<3)
#define ADC2_IER_EOCIE                      (0x1u<<2)
#define ADC2_IER_EOSMPIE                    (0x1u<<1)
#define ADC2_IER_ADRDYIE                    (0x1u<<0)

#define ADC2_IER_LDORDYIE_B_0X0             (0x0u<<12)
#define ADC2_IER_LDORDYIE_B_0X1             (0x1u<<12)
#define ADC2_IER_JQOVFIE_B_0X0              (0x0u<<10)
#define ADC2_IER_JQOVFIE_B_0X1              (0x1u<<10)
#define ADC2_IER_AWD3IE_B_0X0               (0x0u<<9)
#define ADC2_IER_AWD3IE_B_0X1               (0x1u<<9)
#define ADC2_IER_AWD2IE_B_0X0               (0x0u<<8)
#define ADC2_IER_AWD2IE_B_0X1               (0x1u<<8)
#define ADC2_IER_AWD1IE_B_0X0               (0x0u<<7)
#define ADC2_IER_AWD1IE_B_0X1               (0x1u<<7)
#define ADC2_IER_JEOSIE_B_0X0               (0x0u<<6)
#define ADC2_IER_JEOSIE_B_0X1               (0x1u<<6)
#define ADC2_IER_JEOCIE_B_0X0               (0x0u<<5)
#define ADC2_IER_JEOCIE_B_0X1               (0x1u<<5)
#define ADC2_IER_OVRIE_B_0X0                (0x0u<<4)
#define ADC2_IER_OVRIE_B_0X1                (0x1u<<4)
#define ADC2_IER_EOSIE_B_0X0                (0x0u<<3)
#define ADC2_IER_EOSIE_B_0X1                (0x1u<<3)
#define ADC2_IER_EOCIE_B_0X0                (0x0u<<2)
#define ADC2_IER_EOCIE_B_0X1                (0x1u<<2)
#define ADC2_IER_EOSMPIE_B_0X0              (0x0u<<1)
#define ADC2_IER_EOSMPIE_B_0X1              (0x1u<<1)
#define ADC2_IER_ADRDYIE_B_0X0              (0x0u<<0)
#define ADC2_IER_ADRDYIE_B_0X1              (0x1u<<0)

