Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_adc2.h
// CR Configuration

#define ADC2_CR_ADCAL                       (0x1u<<31)
#define ADC2_CR_ADCALDIF                    (0x1u<<30)
#define ADC2_CR_DEEPPWD                     (0x1u<<29)
#define ADC2_CR_ADVREGEN                    (0x1u<<28)
#define ADC2_CR_JADSTP                      (0x1u<<5)
#define ADC2_CR_ADSTP                       (0x1u<<4)
#define ADC2_CR_JADSTART                    (0x1u<<3)
#define ADC2_CR_ADSTART                     (0x1u<<2)
#define ADC2_CR_ADDIS                       (0x1u<<1)
#define ADC2_CR_ADEN                        (0x1u<<0)

#define ADC2_CR_ADCAL_B_0X0                 (0x0u<<31)
#define ADC2_CR_ADCAL_B_0X1                 (0x1u<<31)
#define ADC2_CR_ADCALDIF_B_0X0              (0x0u<<30)
#define ADC2_CR_ADCALDIF_B_0X1              (0x1u<<30)
#define ADC2_CR_DEEPPWD_B_0X0               (0x0u<<29)
#define ADC2_CR_DEEPPWD_B_0X1               (0x1u<<29)
#define ADC2_CR_ADVREGEN_B_0X0              (0x0u<<28)
#define ADC2_CR_ADVREGEN_B_0X1              (0x1u<<28)
#define ADC2_CR_JADSTP_B_0X0                (0x0u<<5)
#define ADC2_CR_JADSTP_B_0X1                (0x1u<<5)
#define ADC2_CR_ADSTP_B_0X0                 (0x0u<<4)
#define ADC2_CR_ADSTP_B_0X1                 (0x1u<<4)
#define ADC2_CR_JADSTART_B_0X0              (0x0u<<3)
#define ADC2_CR_JADSTART_B_0X1              (0x1u<<3)
#define ADC2_CR_ADSTART_B_0X0               (0x0u<<2)
#define ADC2_CR_ADSTART_B_0X1               (0x1u<<2)
#define ADC2_CR_ADDIS_B_0X0                 (0x0u<<1)
#define ADC2_CR_ADDIS_B_0X1                 (0x1u<<1)
#define ADC2_CR_ADEN_B_0X0                  (0x0u<<0)
#define ADC2_CR_ADEN_B_0X1                  (0x1u<<0)

// CFGR1 Configuration

#define ADC2_CFGR1_JQDIS                    (0x1u<<31)
#define ADC2_CFGR1_AWD1CH                   (0x1Fu<<26)
#define ADC2_CFGR1_AWD1CH_0                 (0x1u<<26)
#define ADC2_CFGR1_JAUTO                    (0x1u<<25)
#define ADC2_CFGR1_JAWD1EN                  (0x1u<<24)
#define ADC2_CFGR1_AWD1EN                   (0x1u<<23)
#define ADC2_CFGR1_AWD1SGL                  (0x1u<<22)
#define ADC2_CFGR1_JQM                      (0x1u<<21)
#define ADC2_CFGR1_JDISCEN                  (0x1u<<20)
#define ADC2_CFGR1_DISCNUM                  (0x7u<<17)
#define ADC2_CFGR1_DISCNUM_0                (0x1u<<17)
#define ADC2_CFGR1_DISCEN                   (0x1u<<16)
#define ADC2_CFGR1_AUTDLY                   (0x1u<<14)
#define ADC2_CFGR1_CONT                     (0x1u<<13)
#define ADC2_CFGR1_OVRMOD                   (0x1u<<12)
#define ADC2_CFGR1_EXTEN                    (0x3u<<10)
#define ADC2_CFGR1_EXTEN_0                  (0x1u<<10)
#define ADC2_CFGR1_EXTSEL                   (0x1Fu<<5)
#define ADC2_CFGR1_EXTSEL_0                 (0x1u<<5)
#define ADC2_CFGR1_RES                      (0x3u<<2)
#define ADC2_CFGR1_RES_0                    (0x1u<<2)
#define ADC2_CFGR1_DMNGT                    (0x3u<<0)
#define ADC2_CFGR1_DMNGT_0                  (0x1u<<0)

#define ADC2_CFGR1_JQDIS_B_0X0              (0x0u<<31)
#define ADC2_CFGR1_JQDIS_B_0X1              (0x1u<<31)
#define ADC2_CFGR1_AWD1CH_B_0X0             (0x0u<<26)
#define ADC2_CFGR1_AWD1CH_B_0X1             (0x1u<<26)
#define ADC2_CFGR1_AWD1CH_B_0X13            (0x13u<<26)
#define ADC2_CFGR1_JAUTO_B_0X0              (0x0u<<25)
#define ADC2_CFGR1_JAUTO_B_0X1              (0x1u<<25)
#define ADC2_CFGR1_JAWD1EN_B_0X0            (0x0u<<24)
#define ADC2_CFGR1_JAWD1EN_B_0X1            (0x1u<<24)
#define ADC2_CFGR1_AWD1EN_B_0X0             (0x0u<<23)
#define ADC2_CFGR1_AWD1EN_B_0X1             (0x1u<<23)
#define ADC2_CFGR1_AWD1SGL_B_0X0            (0x0u<<22)
#define ADC2_CFGR1_AWD1SGL_B_0X1            (0x1u<<22)
#define ADC2_CFGR1_JQM_B_0X0                (0x0u<<21)
#define ADC2_CFGR1_JQM_B_0X1                (0x1u<<21)
#define ADC2_CFGR1_JDISCEN_B_0X0            (0x0u<<20)
#define ADC2_CFGR1_JDISCEN_B_0X1            (0x1u<<20)
#define ADC2_CFGR1_DISCNUM_B_0X0            (0x0u<<17)
#define ADC2_CFGR1_DISCNUM_B_0X1            (0x1u<<17)
#define ADC2_CFGR1_DISCNUM_B_0X7            (0x7u<<17)
#define ADC2_CFGR1_DISCEN_B_0X0             (0x0u<<16)
#define ADC2_CFGR1_DISCEN_B_0X1             (0x1u<<16)
#define ADC2_CFGR1_AUTDLY_B_0X0             (0x0u<<14)
#define ADC2_CFGR1_AUTDLY_B_0X1             (0x1u<<14)
#define ADC2_CFGR1_CONT_B_0X0               (0x0u<<13)
#define ADC2_CFGR1_CONT_B_0X1               (0x1u<<13)
#define ADC2_CFGR1_OVRMOD_B_0X0             (0x0u<<12)
#define ADC2_CFGR1_OVRMOD_B_0X1             (0x1u<<12)
#define ADC2_CFGR1_EXTEN_B_0X0              (0x0u<<10)
#define ADC2_CFGR1_EXTEN_B_0X1              (0x1u<<10)
#define ADC2_CFGR1_EXTEN_B_0X2              (0x2u<<10)
#define ADC2_CFGR1_EXTEN_B_0X3              (0x3u<<10)
#define ADC2_CFGR1_EXTSEL_B_0X0             (0x0u<<5)
#define ADC2_CFGR1_EXTSEL_B_0X1             (0x1u<<5)
#define ADC2_CFGR1_EXTSEL_B_0X2             (0x2u<<5)
#define ADC2_CFGR1_EXTSEL_B_0X3             (0x3u<<5)
#define ADC2_CFGR1_EXTSEL_B_0X4             (0x4u<<5)
#define ADC2_CFGR1_EXTSEL_B_0X5             (0x5u<<5)
#define ADC2_CFGR1_EXTSEL_B_0X6             (0x6u<<5)
#define ADC2_CFGR1_EXTSEL_B_0X7             (0x7u<<5)
#define ADC2_CFGR1_EXTSEL_B_0X1F            (0x1Fu<<5)
#define ADC2_CFGR1_RES_B_0X0                (0x0u<<2)
#define ADC2_CFGR1_RES_B_0X1                (0x1u<<2)
#define ADC2_CFGR1_RES_B_0X2                (0x2u<<2)
#define ADC2_CFGR1_RES_B_0X3                (0x3u<<2)
#define ADC2_CFGR1_DMNGT_B_0X0              (0x0u<<0)
#define ADC2_CFGR1_DMNGT_B_0X1              (0x1u<<0)
#define ADC2_CFGR1_DMNGT_B_0X2              (0x2u<<0)
#define ADC2_CFGR1_DMNGT_B_0X3              (0x3u<<0)

// CFGR2 Configuration

#define ADC2_CFGR2_LSHIFT                   (0xFu<<28)
#define ADC2_CFGR2_LSHIFT_0                 (0x1u<<28)
#define ADC2_CFGR2_OVSR                     (0x3FFu<<16)
#define ADC2_CFGR2_OVSR_0                   (0x1u<<16)
#define ADC2_CFGR2_SMPTRIG                  (0x1u<<15)
#define ADC2_CFGR2_SWTRIG                   (0x1u<<14)
#define ADC2_CFGR2_BULB                     (0x1u<<13)
#define ADC2_CFGR2_ROVSM                    (0x1u<<10)
#define ADC2_CFGR2_TROVS                    (0x1u<<9)
#define ADC2_CFGR2_OVSS                     (0xFu<<5)
#define ADC2_CFGR2_OVSS_0                   (0x1u<<5)
#define ADC2_CFGR2_JOVSE                    (0x1u<<1)
#define ADC2_CFGR2_ROVSE                    (0x1u<<0)

