Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_adc2.h
#define ADC2_CFGR2_LSHIFT_B_0X0             (0x0u<<28)
#define ADC2_CFGR2_LSHIFT_B_0X1             (0x1u<<28)
#define ADC2_CFGR2_LSHIFT_B_0X2             (0x2u<<28)
#define ADC2_CFGR2_LSHIFT_B_0X3             (0x3u<<28)
#define ADC2_CFGR2_LSHIFT_B_0X4             (0x4u<<28)
#define ADC2_CFGR2_LSHIFT_B_0X5             (0x5u<<28)
#define ADC2_CFGR2_LSHIFT_B_0X6             (0x6u<<28)
#define ADC2_CFGR2_LSHIFT_B_0X7             (0x7u<<28)
#define ADC2_CFGR2_LSHIFT_B_0X8             (0x8u<<28)
#define ADC2_CFGR2_LSHIFT_B_0X9             (0x9u<<28)
#define ADC2_CFGR2_LSHIFT_B_0XA             (0xAu<<28)
#define ADC2_CFGR2_LSHIFT_B_0XB             (0xBu<<28)
#define ADC2_CFGR2_LSHIFT_B_0XC             (0xCu<<28)
#define ADC2_CFGR2_LSHIFT_B_0XD             (0xDu<<28)
#define ADC2_CFGR2_LSHIFT_B_0XE             (0xEu<<28)
#define ADC2_CFGR2_LSHIFT_B_0XF             (0xFu<<28)
#define ADC2_CFGR2_OVSR_B_0X0               (0x0u<<16)
#define ADC2_CFGR2_OVSR_B_0X1               (0x1u<<16)
#define ADC2_CFGR2_SMPTRIG_B_0X0            (0x0u<<15)
#define ADC2_CFGR2_SMPTRIG_B_0X1            (0x1u<<15)
#define ADC2_CFGR2_SWTRIG_B_0X0             (0x0u<<14)
#define ADC2_CFGR2_SWTRIG_B_0X1             (0x1u<<14)
#define ADC2_CFGR2_BULB_B_0X0               (0x0u<<13)
#define ADC2_CFGR2_BULB_B_0X1               (0x1u<<13)
#define ADC2_CFGR2_ROVSM_B_0X0              (0x0u<<10)
#define ADC2_CFGR2_ROVSM_B_0X1              (0x1u<<10)
#define ADC2_CFGR2_TROVS_B_0X0              (0x0u<<9)
#define ADC2_CFGR2_TROVS_B_0X1              (0x1u<<9)
#define ADC2_CFGR2_OVSS_B_0X0               (0x0u<<5)
#define ADC2_CFGR2_OVSS_B_0X1               (0x1u<<5)
#define ADC2_CFGR2_OVSS_B_0X2               (0x2u<<5)
#define ADC2_CFGR2_OVSS_B_0X3               (0x3u<<5)
#define ADC2_CFGR2_OVSS_B_0X4               (0x4u<<5)
#define ADC2_CFGR2_OVSS_B_0X5               (0x5u<<5)
#define ADC2_CFGR2_OVSS_B_0X6               (0x6u<<5)
#define ADC2_CFGR2_OVSS_B_0X7               (0x7u<<5)
#define ADC2_CFGR2_OVSS_B_0X8               (0x8u<<5)
#define ADC2_CFGR2_OVSS_B_0X9               (0x9u<<5)
#define ADC2_CFGR2_OVSS_B_0XA               (0xAu<<5)
#define ADC2_CFGR2_JOVSE_B_0X0              (0x0u<<1)
#define ADC2_CFGR2_JOVSE_B_0X1              (0x1u<<1)
#define ADC2_CFGR2_ROVSE_B_0X0              (0x0u<<0)
#define ADC2_CFGR2_ROVSE_B_0X1              (0x1u<<0)

// SMPR1 Configuration

#define ADC2_SMPR1_SMP9                     (0x7u<<27)
#define ADC2_SMPR1_SMP9_0                   (0x1u<<27)
#define ADC2_SMPR1_SMP8                     (0x7u<<24)
#define ADC2_SMPR1_SMP8_0                   (0x1u<<24)
#define ADC2_SMPR1_SMP7                     (0x7u<<21)
#define ADC2_SMPR1_SMP7_0                   (0x1u<<21)
#define ADC2_SMPR1_SMP6                     (0x7u<<18)
#define ADC2_SMPR1_SMP6_0                   (0x1u<<18)
#define ADC2_SMPR1_SMP5                     (0x7u<<15)
#define ADC2_SMPR1_SMP5_0                   (0x1u<<15)
#define ADC2_SMPR1_SMP4                     (0x7u<<12)
#define ADC2_SMPR1_SMP4_0                   (0x1u<<12)
#define ADC2_SMPR1_SMP3                     (0x7u<<9)
#define ADC2_SMPR1_SMP3_0                   (0x1u<<9)
#define ADC2_SMPR1_SMP2                     (0x7u<<6)
#define ADC2_SMPR1_SMP2_0                   (0x1u<<6)
#define ADC2_SMPR1_SMP1                     (0x7u<<3)
#define ADC2_SMPR1_SMP1_0                   (0x1u<<3)
#define ADC2_SMPR1_SMP0                     (0x7u<<0)
#define ADC2_SMPR1_SMP0_0                   (0x1u<<0)

#define ADC2_SMPR1_SMP9_B_0X0               (0x0u<<27)
#define ADC2_SMPR1_SMP9_B_0X1               (0x1u<<27)
#define ADC2_SMPR1_SMP9_B_0X2               (0x2u<<27)
#define ADC2_SMPR1_SMP9_B_0X3               (0x3u<<27)
#define ADC2_SMPR1_SMP9_B_0X4               (0x4u<<27)
#define ADC2_SMPR1_SMP9_B_0X5               (0x5u<<27)
#define ADC2_SMPR1_SMP9_B_0X6               (0x6u<<27)
#define ADC2_SMPR1_SMP9_B_0X7               (0x7u<<27)
#define ADC2_SMPR1_SMP8_B_0X0               (0x0u<<24)
#define ADC2_SMPR1_SMP8_B_0X1               (0x1u<<24)
#define ADC2_SMPR1_SMP8_B_0X2               (0x2u<<24)
#define ADC2_SMPR1_SMP8_B_0X3               (0x3u<<24)
#define ADC2_SMPR1_SMP8_B_0X4               (0x4u<<24)
#define ADC2_SMPR1_SMP8_B_0X5               (0x5u<<24)
#define ADC2_SMPR1_SMP8_B_0X6               (0x6u<<24)
#define ADC2_SMPR1_SMP8_B_0X7               (0x7u<<24)
#define ADC2_SMPR1_SMP7_B_0X0               (0x0u<<21)
#define ADC2_SMPR1_SMP7_B_0X1               (0x1u<<21)
#define ADC2_SMPR1_SMP7_B_0X2               (0x2u<<21)
#define ADC2_SMPR1_SMP7_B_0X3               (0x3u<<21)
#define ADC2_SMPR1_SMP7_B_0X4               (0x4u<<21)
#define ADC2_SMPR1_SMP7_B_0X5               (0x5u<<21)
#define ADC2_SMPR1_SMP7_B_0X6               (0x6u<<21)
#define ADC2_SMPR1_SMP7_B_0X7               (0x7u<<21)
#define ADC2_SMPR1_SMP6_B_0X0               (0x0u<<18)
#define ADC2_SMPR1_SMP6_B_0X1               (0x1u<<18)
#define ADC2_SMPR1_SMP6_B_0X2               (0x2u<<18)
#define ADC2_SMPR1_SMP6_B_0X3               (0x3u<<18)
#define ADC2_SMPR1_SMP6_B_0X4               (0x4u<<18)
#define ADC2_SMPR1_SMP6_B_0X5               (0x5u<<18)
#define ADC2_SMPR1_SMP6_B_0X6               (0x6u<<18)
#define ADC2_SMPR1_SMP6_B_0X7               (0x7u<<18)
#define ADC2_SMPR1_SMP5_B_0X0               (0x0u<<15)
#define ADC2_SMPR1_SMP5_B_0X1               (0x1u<<15)
#define ADC2_SMPR1_SMP5_B_0X2               (0x2u<<15)
#define ADC2_SMPR1_SMP5_B_0X3               (0x3u<<15)
#define ADC2_SMPR1_SMP5_B_0X4               (0x4u<<15)
#define ADC2_SMPR1_SMP5_B_0X5               (0x5u<<15)
#define ADC2_SMPR1_SMP5_B_0X6               (0x6u<<15)
#define ADC2_SMPR1_SMP5_B_0X7               (0x7u<<15)
#define ADC2_SMPR1_SMP4_B_0X0               (0x0u<<12)
#define ADC2_SMPR1_SMP4_B_0X1               (0x1u<<12)
#define ADC2_SMPR1_SMP4_B_0X2               (0x2u<<12)
#define ADC2_SMPR1_SMP4_B_0X3               (0x3u<<12)
#define ADC2_SMPR1_SMP4_B_0X4               (0x4u<<12)
#define ADC2_SMPR1_SMP4_B_0X5               (0x5u<<12)
#define ADC2_SMPR1_SMP4_B_0X6               (0x6u<<12)
#define ADC2_SMPR1_SMP4_B_0X7               (0x7u<<12)
#define ADC2_SMPR1_SMP3_B_0X0               (0x0u<<9)
#define ADC2_SMPR1_SMP3_B_0X1               (0x1u<<9)
#define ADC2_SMPR1_SMP3_B_0X2               (0x2u<<9)
#define ADC2_SMPR1_SMP3_B_0X3               (0x3u<<9)
#define ADC2_SMPR1_SMP3_B_0X4               (0x4u<<9)
#define ADC2_SMPR1_SMP3_B_0X5               (0x5u<<9)
#define ADC2_SMPR1_SMP3_B_0X6               (0x6u<<9)
#define ADC2_SMPR1_SMP3_B_0X7               (0x7u<<9)
#define ADC2_SMPR1_SMP2_B_0X0               (0x0u<<6)
#define ADC2_SMPR1_SMP2_B_0X1               (0x1u<<6)
#define ADC2_SMPR1_SMP2_B_0X2               (0x2u<<6)
#define ADC2_SMPR1_SMP2_B_0X3               (0x3u<<6)
#define ADC2_SMPR1_SMP2_B_0X4               (0x4u<<6)
#define ADC2_SMPR1_SMP2_B_0X5               (0x5u<<6)
#define ADC2_SMPR1_SMP2_B_0X6               (0x6u<<6)
#define ADC2_SMPR1_SMP2_B_0X7               (0x7u<<6)
#define ADC2_SMPR1_SMP1_B_0X0               (0x0u<<3)
#define ADC2_SMPR1_SMP1_B_0X1               (0x1u<<3)
#define ADC2_SMPR1_SMP1_B_0X2               (0x2u<<3)
#define ADC2_SMPR1_SMP1_B_0X3               (0x3u<<3)
#define ADC2_SMPR1_SMP1_B_0X4               (0x4u<<3)
#define ADC2_SMPR1_SMP1_B_0X5               (0x5u<<3)
#define ADC2_SMPR1_SMP1_B_0X6               (0x6u<<3)
#define ADC2_SMPR1_SMP1_B_0X7               (0x7u<<3)
#define ADC2_SMPR1_SMP0_B_0X0               (0x0u<<0)
#define ADC2_SMPR1_SMP0_B_0X1               (0x1u<<0)
#define ADC2_SMPR1_SMP0_B_0X2               (0x2u<<0)
#define ADC2_SMPR1_SMP0_B_0X3               (0x3u<<0)
#define ADC2_SMPR1_SMP0_B_0X4               (0x4u<<0)
#define ADC2_SMPR1_SMP0_B_0X5               (0x5u<<0)
#define ADC2_SMPR1_SMP0_B_0X6               (0x6u<<0)
#define ADC2_SMPR1_SMP0_B_0X7               (0x7u<<0)

