Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_adc2.h
#define ADC2_SQR1_L_B_0X0                   (0x0u<<0)
#define ADC2_SQR1_L_B_0X1                   (0x1u<<0)
#define ADC2_SQR1_L_B_0XF                   (0xFu<<0)

// SQR2 Configuration

#define ADC2_SQR2_SQ9                       (0x1Fu<<24)
#define ADC2_SQR2_SQ9_0                     (0x1u<<24)
#define ADC2_SQR2_SQ8                       (0x1Fu<<18)
#define ADC2_SQR2_SQ8_0                     (0x1u<<18)
#define ADC2_SQR2_SQ7                       (0x1Fu<<12)
#define ADC2_SQR2_SQ7_0                     (0x1u<<12)
#define ADC2_SQR2_SQ6                       (0x1Fu<<6)
#define ADC2_SQR2_SQ6_0                     (0x1u<<6)
#define ADC2_SQR2_SQ5                       (0x1Fu<<0)
#define ADC2_SQR2_SQ5_0                     (0x1u<<0)

// SQR3 Configuration

#define ADC2_SQR3_SQ14                      (0x1Fu<<24)
#define ADC2_SQR3_SQ14_0                    (0x1u<<24)
#define ADC2_SQR3_SQ13                      (0x1Fu<<18)
#define ADC2_SQR3_SQ13_0                    (0x1u<<18)
#define ADC2_SQR3_SQ12                      (0x1Fu<<12)
#define ADC2_SQR3_SQ12_0                    (0x1u<<12)
#define ADC2_SQR3_SQ11                      (0x1Fu<<6)
#define ADC2_SQR3_SQ11_0                    (0x1u<<6)
#define ADC2_SQR3_SQ10                      (0x1Fu<<0)
#define ADC2_SQR3_SQ10_0                    (0x1u<<0)

// SQR4 Configuration

#define ADC2_SQR4_SQ16                      (0x1Fu<<6)
#define ADC2_SQR4_SQ16_0                    (0x1u<<6)
#define ADC2_SQR4_SQ15                      (0x1Fu<<0)
#define ADC2_SQR4_SQ15_0                    (0x1u<<0)

// DR Configuration

#define ADC2_DR_RDATA                       (0xFFFFFFFFu<<0)
#define ADC2_DR_RDATA_0                     (0x1u<<0)

// JSQR Configuration

#define ADC2_JSQR_JSQ4                      (0x1Fu<<27)
#define ADC2_JSQR_JSQ4_0                    (0x1u<<27)
#define ADC2_JSQR_JSQ3                      (0x1Fu<<21)
#define ADC2_JSQR_JSQ3_0                    (0x1u<<21)
#define ADC2_JSQR_JSQ2                      (0x1Fu<<15)
#define ADC2_JSQR_JSQ2_0                    (0x1u<<15)
#define ADC2_JSQR_JSQ1                      (0x1Fu<<9)
#define ADC2_JSQR_JSQ1_0                    (0x1u<<9)
#define ADC2_JSQR_JEXTEN                    (0x3u<<7)
#define ADC2_JSQR_JEXTEN_0                  (0x1u<<7)
#define ADC2_JSQR_JEXTSEL                   (0x1Fu<<2)
#define ADC2_JSQR_JEXTSEL_0                 (0x1u<<2)
#define ADC2_JSQR_JL                        (0x3u<<0)
#define ADC2_JSQR_JL_0                      (0x1u<<0)

#define ADC2_JSQR_JEXTEN_B_0X0              (0x0u<<7)
#define ADC2_JSQR_JEXTEN_B_0X1              (0x1u<<7)
#define ADC2_JSQR_JEXTEN_B_0X2              (0x2u<<7)
#define ADC2_JSQR_JEXTEN_B_0X3              (0x3u<<7)
#define ADC2_JSQR_JEXTSEL_B_0X0             (0x0u<<2)
#define ADC2_JSQR_JEXTSEL_B_0X1             (0x1u<<2)
#define ADC2_JSQR_JEXTSEL_B_0X2             (0x2u<<2)
#define ADC2_JSQR_JEXTSEL_B_0X3             (0x3u<<2)
#define ADC2_JSQR_JEXTSEL_B_0X4             (0x4u<<2)
#define ADC2_JSQR_JEXTSEL_B_0X5             (0x5u<<2)
#define ADC2_JSQR_JEXTSEL_B_0X6             (0x6u<<2)
#define ADC2_JSQR_JEXTSEL_B_0X7             (0x7u<<2)
#define ADC2_JSQR_JEXTSEL_B_0X1F            (0x1Fu<<2)
#define ADC2_JSQR_JL_B_0X0                  (0x0u<<0)
#define ADC2_JSQR_JL_B_0X1                  (0x1u<<0)
#define ADC2_JSQR_JL_B_0X2                  (0x2u<<0)
#define ADC2_JSQR_JL_B_0X3                  (0x3u<<0)

// OFCFGR1 Configuration

#define ADC2_OFCFGR1_OFFSET_CH              (0x1Fu<<27)
#define ADC2_OFCFGR1_OFFSET_CH_0            (0x1u<<27)
#define ADC2_OFCFGR1_SSAT                   (0x1u<<26)
#define ADC2_OFCFGR1_USAT                   (0x1u<<25)
#define ADC2_OFCFGR1_POSOFF                 (0x1u<<24)

#define ADC2_OFCFGR1_SSAT_B_0X0             (0x0u<<26)
#define ADC2_OFCFGR1_SSAT_B_0X1             (0x1u<<26)
#define ADC2_OFCFGR1_USAT_B_0X0             (0x0u<<25)
#define ADC2_OFCFGR1_USAT_B_0X1             (0x1u<<25)
#define ADC2_OFCFGR1_POSOFF_B_0X0           (0x0u<<24)
#define ADC2_OFCFGR1_POSOFF_B_0X1           (0x1u<<24)

// OFCFGR2 Configuration

#define ADC2_OFCFGR2_OFFSET_CH              (0x1Fu<<27)
#define ADC2_OFCFGR2_OFFSET_CH_0            (0x1u<<27)
#define ADC2_OFCFGR2_SSAT                   (0x1u<<26)
#define ADC2_OFCFGR2_USAT                   (0x1u<<25)
#define ADC2_OFCFGR2_POSOFF                 (0x1u<<24)

#define ADC2_OFCFGR2_SSAT_B_0X0             (0x0u<<26)
#define ADC2_OFCFGR2_SSAT_B_0X1             (0x1u<<26)
#define ADC2_OFCFGR2_USAT_B_0X0             (0x0u<<25)
#define ADC2_OFCFGR2_USAT_B_0X1             (0x1u<<25)
#define ADC2_OFCFGR2_POSOFF_B_0X0           (0x0u<<24)
#define ADC2_OFCFGR2_POSOFF_B_0X1           (0x1u<<24)

// OFCFGR3 Configuration

#define ADC2_OFCFGR3_OFFSET_CH              (0x1Fu<<27)
#define ADC2_OFCFGR3_OFFSET_CH_0            (0x1u<<27)
#define ADC2_OFCFGR3_SSAT                   (0x1u<<26)
#define ADC2_OFCFGR3_USAT                   (0x1u<<25)
#define ADC2_OFCFGR3_POSOFF                 (0x1u<<24)

#define ADC2_OFCFGR3_SSAT_B_0X0             (0x0u<<26)
#define ADC2_OFCFGR3_SSAT_B_0X1             (0x1u<<26)
#define ADC2_OFCFGR3_USAT_B_0X0             (0x0u<<25)
#define ADC2_OFCFGR3_USAT_B_0X1             (0x1u<<25)
#define ADC2_OFCFGR3_POSOFF_B_0X0           (0x0u<<24)
#define ADC2_OFCFGR3_POSOFF_B_0X1           (0x1u<<24)

// OFCFGR4 Configuration

#define ADC2_OFCFGR4_OFFSET_CH              (0x1Fu<<27)
#define ADC2_OFCFGR4_OFFSET_CH_0            (0x1u<<27)
#define ADC2_OFCFGR4_SSAT                   (0x1u<<26)
#define ADC2_OFCFGR4_USAT                   (0x1u<<25)
#define ADC2_OFCFGR4_POSOFF                 (0x1u<<24)

#define ADC2_OFCFGR4_SSAT_B_0X0             (0x0u<<26)
#define ADC2_OFCFGR4_SSAT_B_0X1             (0x1u<<26)
#define ADC2_OFCFGR4_USAT_B_0X0             (0x0u<<25)
#define ADC2_OFCFGR4_USAT_B_0X1             (0x1u<<25)
#define ADC2_OFCFGR4_POSOFF_B_0X0           (0x0u<<24)
#define ADC2_OFCFGR4_POSOFF_B_0X1           (0x1u<<24)

// OFR1 Configuration

#define ADC2_OFR1_OFFSET                    (0x3FFFFFu<<0)
#define ADC2_OFR1_OFFSET_0                  (0x1u<<0)

